bernabeu-a/trampoline/examples/cortex/armv7em/efm32wg/audiomoth/yellow_hammer_audiomoth/main.c
#include "tpl_os.h"
#include "tpl_os_event.h"

#include <stdint.h>
#include <stdlib.h>
#include <time.h>
#include <math.h>
#include <string.h>

#include "em_device.h"
#include "em_chip.h"
#include "em_cmu.h"

#include "em_adc.h"
#include "em_prs.h"
#include "em_timer.h"
#include "em_dma.h"
#include "em_gpio.h"
#include "em_ebi.h"
#include "em_burtc.h"
#include "em_rtc.h"
#include "em_opamp.h"

/* Filter coefficients */
#include "fir_coeffs.h"

/* ARM CMSISDSP */
#include "arm_math.h"

#define ROUNDED_DIV(a, b)                         (((a) + ((b)/2)) / (b))

// #define PRE_PROCESSING_RMS
#define PRE_PROCESSING_MAX

typedef struct {
	char id[4];
	uint32_t size;
  } chunk_t;

  typedef struct {
	chunk_t icmt;
	char comment[384];
  } icmt_t;
  
  typedef struct {
	chunk_t iart;
	char artist[32];
  } iart_t;

typedef struct {
	uint16_t format;
	uint16_t numberOfChannels;
	uint32_t samplesPerSecond;
	uint32_t bytesPerSecond;
	uint16_t bytesPerCapture;
	uint16_t bitsPerSample;
  } wavFormat_t;

typedef struct {
	chunk_t riff;
	char format[4];
	chunk_t fmt;
	wavFormat_t wavFormat;
	chunk_t list;
	char info[4];
	icmt_t icmt;
	iart_t iart;
	chunk_t data;
} wavHeader_t;

FIL fileaudio;
static UINT bw;

typedef struct {
	// uint8_t seconds;
	// uint8_t minutes;
	// uint8_t hours;
	// uint8_t days;
	uint32_t unix_timestamp;
} timekeeper_t;


const int duration_in_second = 3;
const uint16_t samplerate = 20480;

/* Header detail of wav file */
const wavHeader_t wavHeader = {
	.riff = {.id = "RIFF", .size = 2 * samplerate * duration_in_second +
		sizeof(wavHeader_t) - sizeof(chunk_t)},
	.format = "WAVE",
	.fmt = {.id = "fmt ", .size = sizeof(wavFormat_t)},
	.wavFormat = {.format = 1,							/* PCM format */
					.numberOfChannels = 1,
					.samplesPerSecond = samplerate,
					.bytesPerSecond = 2*samplerate,
					.bytesPerCapture = 2,
					.bitsPerSample = 16},
	.list = {.id = "LIST",
				.size = 4 + sizeof(icmt_t) + sizeof(iart_t)},
	.info = "INFO",
	.icmt = {.icmt.id = "ICMT", .icmt.size = 0, .comment = ""},
	.iart = {.iart.id = "IART", .iart.size = 0, .artist = ""},
	.data = {.id = "data", 
			 .size = 2 * samplerate * duration_in_second}
};

#define APP_Task_write_audio_START_SEC_VAR_NOINIT_UNSPECIFIED
#include "tpl_memmap.h"
VAR(timekeeper_t, AUTOMATIC) timekeeper;
#define APP_Task_write_audio_STOP_SEC_VAR_NOINIT_UNSPECIFIED
#include "tpl_memmap.h"

#define APP_COMMON_START_SEC_CODE
#include "tpl_memmap.h"
VAR(float, AUTOMATIC) envelope_1 [80] = {0};
VAR(float, AUTOMATIC) envelope_2 [80] = {0};
VAR(float, AUTOMATIC) envelope_3 [80] = {0};

P2VAR(float, AUTOMATIC, AUTOMATIC) ping_ptr_envelope1;
P2VAR(float, AUTOMATIC, AUTOMATIC) ping_ptr_envelope2;
P2VAR(float, AUTOMATIC, AUTOMATIC) ping_ptr_envelope3;

P2VAR(float, AUTOMATIC, AUTOMATIC) pong_ptr_envelope1;
P2VAR(float, AUTOMATIC, AUTOMATIC) pong_ptr_envelope2;
P2VAR(float, AUTOMATIC, AUTOMATIC) pong_ptr_envelope3;

FUNC(int, OS_APPL_CODE) main(void){
	CHIP_Init();
	// Enable Clock to GPIO
	CMU_ClockEnable(cmuClock_GPIO, true);
	/* Enable high frequency HFXO clock */
    CMU_OscillatorEnable(cmuOsc_HFXO, true, true);
    CMU_ClockDivSet(cmuClock_HF, cmuClkDiv_1);
    CMU_ClockSelectSet(cmuClock_HF, cmuSelect_HFXO);
    CMU_OscillatorEnable(cmuOsc_HFRCO, false, false);
	/* Enable clock to Low energy module */
	CMU_ClockEnable(cmuClock_CORELE, true);
	/* Setup NVIC for DMA */
	NVIC_ClearPendingIRQ(DMA_IRQn);
  	NVIC_EnableIRQ(DMA_IRQn);
	/* Setup RTCC */
	CMU_OscillatorEnable(cmuOsc_LFXO, true, true);
    CMU_ClockSelectSet(cmuClock_LFA, cmuSelect_LFXO);
	CMU_ClockEnable(cmuClock_RTC, true);
	RTC_Init_TypeDef rtcInit = RTC_INIT_DEFAULT;
	rtcInit.enable = false;
	rtcInit.debugRun = true;
	RTC_Init(&rtcInit);
	RTC_CompareSet(0, 32768);
	NVIC_ClearPendingIRQ(RTC_IRQn);
	NVIC_EnableIRQ(RTC_IRQn);
	RTC_IntEnable(RTC_IF_COMP0);
    RTC_Enable(true);
	// timekeeper.seconds = 0;
	// timekeeper.minutes = 0;
	// timekeeper.hours = 0;
	// timekeeper.days = 0;
	/* GPIO A */
	GPIO_PinModeSet(gpioPortA, 0, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 1, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 2, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 3, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 4, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 5, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 6, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 7, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 8, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 9, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 10, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 11, gpioModePushPull, 0);
	GPIO_PinModeSet(gpioPortA, 12, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 13, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 14, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortA, 15, gpioModeDisabled, 0);
	/* GPIO B */
	GPIO_PinModeSet(gpioPortB, 0, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortB, 1, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortB, 2, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortB, 3, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortB, 4, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortB, 5, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortB, 6, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortB, 9, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortB, 10, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortB, 11, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortB, 12, gpioModeDisabled, 0);
	/* GPIO C */
	GPIO_PinModeSet(gpioPortC, 0, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortC, 1, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortC, 3, gpioModePushPull, 0);
	GPIO_PinModeSet(gpioPortC, 7, gpioModeDisabled, 0);	
	GPIO_PinModeSet(gpioPortC, 8, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortC, 9, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortC, 10, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortC, 11, gpioModeDisabled, 0);
	/* GPIO D */
    GPIO_PinModeSet(gpioPortD, 0, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortD, 1, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortD, 2, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortD, 3, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortD, 4, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortD, 5, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortD, 9, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortD, 10, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortD, 11, gpioModePushPull, 1);
	GPIO_PinModeSet(gpioPortD, 12, gpioModePushPull, 1);
	/* GPIO E */
	GPIO_PinModeSet(gpioPortE, 0, gpioModePushPull, 1);
	GPIO_PinModeSet(gpioPortE, 1, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortE, 2, gpioModePushPull, 1);
	GPIO_PinModeSet(gpioPortE, 3, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortE, 4, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortE, 5, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortE, 6, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortE, 7, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortE, 8, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortE, 9, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortE, 10, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortE, 11, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortE, 12, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortE, 13, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortE, 14, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortE, 15, gpioModeDisabled, 0);
	/* GPIO F */
	GPIO_PinModeSet(gpioPortF, 3, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortF, 4, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortF, 5, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortF, 6, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortF, 7, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortF, 8, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortF, 9, gpioModeDisabled, 0);
	GPIO_PinModeSet(gpioPortF, 12, gpioModeDisabled, 0);
	// Set GPIO Red Led to Output
	// Red Led on PC4
	GPIO->P[gpioPortC].MODEL |= 4 << (16);
	// Set GPIO Green Led to Output
	// Green Led on PC5
	GPIO->P[gpioPortC].MODEL |= 4 << (20);
	// Set A7 to ouput for debug
	GPIO->P[gpioPortA].MODEL |= 4 << (7*4);
	// Set A8 to ouput for debug
	// GPIO->P[gpioPortA].MODEL |= 4 << (8*4);
	// Set B10 to ouput for debug
	// GPIO->P[gpioPortB].MODEL |= 4 << (10*4);
	// Set B9 to ouput for debug
	// GPIO->P[gpioPortB].MODEL |= 4 << (9*4);
	/* Start Trampoline */
	StartOS(OSDEFAULTAPPMODE);
	return 0;
}

#define APP_COMMON_STOP_SEC_CODE
#include "tpl_memmap.h"

