bernabeu-a/trampoline/examples/cortex/armv7em/efm32wg/audiomoth/yellow_hammer_audiomoth/main.c
	/* Setup PRS (Peripheral Reflex System) between Timer and ADC */
	CMU_ClockEnable(cmuClock_PRS, true);
	CMU_ClockEnable(cmuClock_TIMER2, true);
	/* Connect PRS channel 0 to TIMER overflow */
	PRS_SourceSignalSet(0, PRS_CH_CTRL_SOURCESEL_TIMER2, PRS_CH_CTRL_SIGSEL_TIMER2OF, prsEdgeOff);
	/* Enable TIMER with default settings */
	TIMER_Init_TypeDef timerInit = TIMER_INIT_DEFAULT;
	timerInit.enable = false;
	TIMER_Init(TIMER2, &timerInit);
	/* Configure TIMER to trigger on sampling rate */
	TIMER_TopSet(TIMER2,  CMU_ClockFreqGet(cmuClock_TIMER2) / 20480 - 1);
	/* Enable Timer on ADC */
	TIMER_Enable(TIMER2, true);
	/* Start ADC sample */
	ADC_Start(ADC0, adcStartSingle);
	TerminateTask();
}
#define APP_Task_start_dma_STOP_SEC_CODE
#include "tpl_memmap.h"


#define APP_Task_copyDMAtoSRAM_START_SEC_CODE
#include "tpl_memmap.h"

// P2VAR(int16_t, AUTOMATIC, OS_VAR) buffer_sram;
// VAR(float, AUTOMATIC) buffer_float_sound [1024] = {0.0f};

VAR(uint8_t,AUTOMATIC) count_env = 0;
/* EBI region 0 */
#define SRAM_EXT_START_ADDR 	0x80000000

#define SRAM_EXT_START_ADDR_1 	0x80001000
#define SRAM_EXT_START_ADDR_2 	0x80002000
#define SRAM_EXT_START_ADDR_3 	0x80003000
#define SRAM_EXT_START_ADDR_4 	0x80004000
#define SRAM_EXT_START_ADDR_5 	0x80005000
#define SRAM_EXT_START_ADDR_6 	0x80006000
#define SRAM_EXT_START_ADDR_7 	0x80007000
#define SRAM_EXT_START_ADDR_8 	0x80008000
#define SRAM_EXT_START_ADDR_9 	0x80009000
#define SRAM_EXT_START_ADDR_10 	0x8000A000
#define SRAM_EXT_START_ADDR_11 	0x8000B000
#define SRAM_EXT_START_ADDR_12 	0x8000C000
#define SRAM_EXT_START_ADDR_13 	0x8000D000
#define SRAM_EXT_START_ADDR_14 	0x8000E000
#define SRAM_EXT_START_ADDR_15 	0x8000F000
#define SRAM_EXT_START_ADDR_16 	0x80010000
#define SRAM_EXT_START_ADDR_17 	0x80011000
#define SRAM_EXT_START_ADDR_18 	0x80012000
#define SRAM_EXT_START_ADDR_19 	0x80013000
#define SRAM_EXT_START_ADDR_20 	0x80014000

/* We have 2 buffer of 1024 int16 in SRAM EXT --> START AT + 0x800 */
#define SRAM_EXT_START_FILTERED_PING_BAND1_ADDR 	0x80015000
/* + 1024 FLOAT --> + 4*1024 BYTES */
#define SRAM_EXT_START_FILTERED_PONG_BAND1_ADDR 	0x80016000
#define SRAM_EXT_START_FILTERED_PING_BAND1_ADDR_BIS 0x80017000

#define SRAM_EXT_START_FILTERED_PING_BAND2_ADDR 	0x80018000
#define SRAM_EXT_START_FILTERED_PONG_BAND2_ADDR 	0x80019000
#define SRAM_EXT_START_FILTERED_PING_BAND2_ADDR_BIS 0x8001A000

#define SRAM_EXT_START_FILTERED_PING_BAND3_ADDR 	0x8001B000
#define SRAM_EXT_START_FILTERED_PONG_BAND3_ADDR 	0x8001C000
#define SRAM_EXT_START_FILTERED_PING_BAND3_ADDR_BIS 0x8001D000

#define SRAM_EXT_PING_ENVELOPE1						0x80020000
#define SRAM_EXT_PING_ENVELOPE2						0x80021000
#define SRAM_EXT_PING_ENVELOPE3						0x80022000

#define SRAM_EXT_PONG_ENVELOPE1						0x80023000
#define SRAM_EXT_PONG_ENVELOPE2						0x80024000
#define SRAM_EXT_PONG_ENVELOPE3						0x80025000

int16_t *buffer_sram;
float32_t *prev_ping_buffer_filtered_band1;
float32_t *prev_pong_buffer_filtered_band1;
float32_t *prev_ping_buffer_filtered_band1_bis;

float32_t *prev_ping_buffer_filtered_band2;
float32_t *prev_pong_buffer_filtered_band2;
float32_t *prev_ping_buffer_filtered_band2_bis;

float32_t *prev_ping_buffer_filtered_band3;
float32_t *prev_pong_buffer_filtered_band3;
float32_t *prev_ping_buffer_filtered_band3_bis;

/* Number of 2nd order stage in filter, order is 2*numStagesIIR */
const uint32_t numStagesIIR = 3;

float32_t firStateF32_band2 [2*3] = {0};
static float32_t firStateF32_band3 [2*3] = {0};

#ifdef PRE_PROCESSING_MAX
static float32_t firStateF32_low1 [2*2] = {0};
static float32_t firStateF32_low2 [2*2] = {0};
static float32_t firStateF32_low3 [2*2] = {0};
#endif

P2VAR(int16_t, AUTOMATIC, OS_APPL_DATA) buffer_ptr_sram[20] = {
	(int16_t *) SRAM_EXT_START_ADDR_1,
	(int16_t *) SRAM_EXT_START_ADDR_2,
	(int16_t *) SRAM_EXT_START_ADDR_3,
	(int16_t *) SRAM_EXT_START_ADDR_4,
	(int16_t *) SRAM_EXT_START_ADDR_5,
	(int16_t *) SRAM_EXT_START_ADDR_6,
	(int16_t *) SRAM_EXT_START_ADDR_7,
	(int16_t *) SRAM_EXT_START_ADDR_8,
	(int16_t *) SRAM_EXT_START_ADDR_9,
	(int16_t *) SRAM_EXT_START_ADDR_10,
	(int16_t *) SRAM_EXT_START_ADDR_11,
	(int16_t *) SRAM_EXT_START_ADDR_12,
	(int16_t *) SRAM_EXT_START_ADDR_13,
	(int16_t *) SRAM_EXT_START_ADDR_14,
	(int16_t *) SRAM_EXT_START_ADDR_15,
	(int16_t *) SRAM_EXT_START_ADDR_16,
	(int16_t *) SRAM_EXT_START_ADDR_17,
	(int16_t *) SRAM_EXT_START_ADDR_18,
	(int16_t *) SRAM_EXT_START_ADDR_19,
	(int16_t *) SRAM_EXT_START_ADDR_20
};

VAR(uint8_t, AUTOMATIC) count_ptr_buffer = 0;

VAR(uint8_t, AUTOMATIC) is_writting_audio = 0;

VAR(float32_t, AUTOMATIC) max_pool_for_low_pass1 [80] = {0};
uint32_t *indexMax1;
VAR(float32_t, AUTOMATIC) max_pool_for_low_pass2 [80] = {0};
uint32_t *indexMax2;
VAR(float32_t, AUTOMATIC) max_pool_for_low_pass3 [80] = {0};
uint32_t *indexMax3;

// VAR(uint8_t, AUTOMATIC) init_filter = 1;

TASK(copyDMAtoSRAM){
	// GPIO->P[gpioPortA].DOUT ^= 1<<7;
	/* Wait for event to transfer audio to sram */
	EventMaskType ev;
	WaitEvent(ev_DMAtoSRAM);
	GetEvent(copyDMAtoSRAM, &ev);
	ClearEvent(ev);
	GPIO->P[gpioPortB].DOUT |= 1<<10;
	/* We have 20 buffer of sound ie --> 1s of sound */
	// static uint8_t count_ptr_buffer = 0;

	int16_t *buffer_dma;
	if(isPrimaryDMABuffer){
		buffer_dma = secondaryBuffer;
	}
	else{
		buffer_dma = primaryBuffer;
	}

	buffer_sram = (int16_t *) SRAM_EXT_START_ADDR;
	int16_t *tmp_data_buffer_ptr_sram = buffer_ptr_sram[count_ptr_buffer];
	for(uint16_t i = 0; i < 1024; i++){
		// *buffer_ptr_sram[count_ptr_buffer]++ = *buffer_dma++;
		*tmp_data_buffer_ptr_sram++ = *buffer_dma++;
	}

	if(is_writting_audio){
		SetEvent(write_audio, ev_write_audio);
		ChainTask(copyDMAtoSRAM);
	}
	// buffer_sram = (int16_t *) SRAM_EXT_START_ADDR;
	// float32_t *input_float_test = data_input;
	// static float32_t filtered_rms_band1 [1024];
	arm_biquad_cascade_df2T_instance_f32 instFilter1;
	arm_biquad_cascade_df2T_instance_f32 instFilter2;
	arm_biquad_cascade_df2T_instance_f32 instFilter3;
	float32_t firStateF32_band1 [2*3] = {0};
	arm_biquad_cascade_df2T_init_f32(&instFilter1, numStagesIIR, &firCoefF32_band1[0], &firStateF32_band1[0]);
	arm_biquad_cascade_df2T_init_f32(&instFilter2, numStagesIIR, &firCoefF32_band2[0], &firStateF32_band2[0]);
	arm_biquad_cascade_df2T_init_f32(&instFilter3, numStagesIIR, &firCoefF32_band3[0], &firStateF32_band3[0]);

	prev_ping_buffer_filtered_band1 = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND1_ADDR;
	prev_pong_buffer_filtered_band1 = (float32_t *) SRAM_EXT_START_FILTERED_PONG_BAND1_ADDR;
	prev_ping_buffer_filtered_band1_bis = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND1_ADDR_BIS;

	prev_ping_buffer_filtered_band2 = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND2_ADDR;
	prev_pong_buffer_filtered_band2 = (float32_t *) SRAM_EXT_START_FILTERED_PONG_BAND2_ADDR;
	prev_ping_buffer_filtered_band2_bis = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND2_ADDR_BIS;

	prev_ping_buffer_filtered_band3 = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND3_ADDR;
	prev_pong_buffer_filtered_band3 = (float32_t *) SRAM_EXT_START_FILTERED_PONG_BAND3_ADDR;
	prev_ping_buffer_filtered_band3_bis = (float32_t *) SRAM_EXT_START_FILTERED_PING_BAND3_ADDR_BIS;

