bernabeu-a/trampoline/examples/cortex/armv7em/efm32wg/audiomoth/yellow_hammer_audiomoth/main.c
	}

	count_ptr_buffer++;
	if(count_ptr_buffer == 20) count_ptr_buffer = 0;

	GPIO->P[gpioPortB].DOUT &= ~(1<<10);
	ChainTask(copyDMAtoSRAM);
}
#define APP_Task_copyDMAtoSRAM_STOP_SEC_CODE
#include "tpl_memmap.h"

#define APP_Task_start_sdcard_START_SEC_CODE
#include "tpl_memmap.h"

static FATFS fatfs;

static void setTime(uint32_t time, uint32_t milliseconds) {
	/* 1024 tick per seconds */
    uint32_t ticks = ROUNDED_DIV(1024 * milliseconds, 1000);
    uint64_t intendedCounter = 1024 * (uint64_t)time + ticks;
    uint64_t offset = intendedCounter - (uint64_t)BURTC_CounterGet();
    BURTC_RetRegSet(1, (uint32_t)(offset >> 32));
    BURTC_RetRegSet(0, (uint32_t)(offset & 0xFFFFFFFF));
    BURTC_RetRegSet(2, 0x11223344);
	return;
}

static void getTime(uint32_t *time, uint32_t *milliseconds) {

    uint64_t offset =  (uint64_t)BURTC_RetRegGet(1) << 32;
    offset += (uint64_t)BURTC_RetRegGet(0);
    uint64_t currentCounter = offset + BURTC_CounterGet();

    if (time != NULL) {
        *time = currentCounter / 1024;
    }

    if (milliseconds != NULL) {
        uint32_t ticks = currentCounter % 1024;
        *milliseconds = ROUNDED_DIV(1000 * ticks, 1024);
    }
	return;
}

static void handleTimeOverflow(void) {
    uint32_t offsetHigh = BURTC_RetRegGet(1);
    BURTC_RetRegSet(1, offsetHigh + 1);
}

/* Time function for FAT file system */
DWORD get_fattime(void) {

    int8_t timezoneHours = 0;

    int8_t timezoneMinutes = 0;

    uint32_t currentTime;

    getTime(&currentTime, NULL);

    if (BURTC_IntGet() & BURTC_IF_OF) {
        handleTimeOverflow();
        getTime(&currentTime, NULL);
        BURTC_IntClear(BURTC_IF_OF);
    }

    time_t fatTime = currentTime + timezoneHours * 60 * 60 + timezoneMinutes * 60;

    struct tm timePtr;
	// return 0;
    gmtime_r(&fatTime, &timePtr);

    return (((unsigned int)timePtr.tm_year - 208) << 25) |
            (((unsigned int)timePtr.tm_mon + 1 ) << 21) |
            ((unsigned int)timePtr.tm_mday << 16) |
            ((unsigned int)timePtr.tm_hour << 11) |
            ((unsigned int)timePtr.tm_min << 5) |
            ((unsigned int)timePtr.tm_sec >> 1);
}


TASK(start_sdcard){
	GPIO_PinModeSet(gpioPortD, 12, gpioModePushPull, 1);
	/* Turn on SD card (PortD 12)*/
	GPIO_PinOutClear(gpioPortD, 12);
	/* Init */
	MICROSD_Init();
	/* Check SD card status */
	DSTATUS resCard = disk_initialize(0);
	if (resCard == STA_NOINIT || resCard == STA_NODISK || resCard == STA_PROTECT) {
        while(1);
    }
    /* Initialise file system */
    if (f_mount(&fatfs, "", 1) != FR_OK) {
        while(1);
    }

	/* Debug */

	TerminateTask();

}
#define APP_Task_start_sdcard_STOP_SEC_CODE
#include "tpl_memmap.h"

#define APP_Task_write_audio_START_SEC_CODE
#include "tpl_memmap.h"

void update_timekeeper(void){
	timekeeper.unix_timestamp++;
}

// void timekeeper_fron_unix(void){
// 	uint32_t temp_timestamp = timekeeper.unix_timestamp;
// 	timekeeper.days = temp_timestamp / 86400;
// 	temp_timestamp %= 86400;
// 	timekeeper.hours = temp_timestamp / 3600;
// 	temp_timestamp %= 3600;
// 	timekeeper.minutes = temp_timestamp / 60;
// 	timekeeper.seconds = temp_timestamp % 60;
// }

TASK(write_audio){
	/* We are here from inference hit */

	/* First set writting_variable */
	is_writting_audio = 1;
	/* Create a file */
	char *filename;
	char filename_buffer[15];
	/* Count number of digit in timestamp for offset extension of file */
	uint8_t count_digit = 0;
	uint32_t tmp_timestamp = timekeeper.unix_timestamp;
    while(tmp_timestamp>0){
        count_digit++;
        tmp_timestamp = tmp_timestamp/10;
    }

	filename = __itoa(timekeeper.unix_timestamp, filename_buffer, 10);
	strcpy(filename+count_digit, ".wav");
	f_open(&fileaudio, filename, FA_OPEN_APPEND | FA_WRITE);
	f_write(&fileaudio, &wavHeader, sizeof(wavHeader_t), &bw);
	/* Current audio buffer to write is count_ptr_buffer */
	/* First write previous buffers */
	uint8_t read_count_ptr_buffer = count_ptr_buffer + 1;
	if(read_count_ptr_buffer == 20) read_count_ptr_buffer = 0;
	while(read_count_ptr_buffer != count_ptr_buffer){
		f_write(&fileaudio, buffer_ptr_sram[read_count_ptr_buffer], 2*1024, &bw);
		read_count_ptr_buffer++;
		if(read_count_ptr_buffer == 20) read_count_ptr_buffer = 0;
	}
	/* Now write next 2s of sound */
	uint8_t count_write_audio_post_inference = 0; 
	while(count_write_audio_post_inference != 40){
		EventMaskType ev_wr;
		WaitEvent(ev_write_audio);
		GetEvent(write_audio, &ev_wr);
		ClearEvent(ev_wr);
		f_write(&fileaudio, buffer_ptr_sram[count_ptr_buffer-1], 2*1024, &bw);
		count_write_audio_post_inference++;
	}
	is_writting_audio = 0;
	f_close(&fileaudio);
	TerminateTask();
}
#define APP_Task_write_audio_STOP_SEC_CODE
#include "tpl_memmap.h"

#define APP_ISR_isr_dma_START_SEC_CODE
#include "tpl_memmap.h"
ISR(isr_dma){
	/* Get interrupt mask */
	uint32_t interruptMask = DMA_IntGet();
	if(interruptMask == DMA_IF_CH0DONE){
		/* Clear interrupt */
		DMA_IntClear(DMA_IFC_CH0DONE);
		isPrimaryDMABuffer = !isPrimaryDMABuffer;
		/* Re-activate the DMA */
    	DMA_RefreshPingPong(0,
        	isPrimaryDMABuffer,						/* bool to change between dma descriptor, primaryBuffer or secondaryBuffer DST*/
        	false,
        	NULL,									/* dst : NULL = same as in descriptor, thus same as in start dma TASK, (void*)primaryBuffer or (void*)secondaryBuffer */
        	NULL,									/* src : NULL = same as in descriptor, thus same as in start dma TASK, (void*)&(ADC0->SINGLEDATA) */
        	numberOfSamplesPerTransfer - 1,
        	false);
		SetEvent(copyDMAtoSRAM, ev_DMAtoSRAM);
	}
	else if (interruptMask == DMA_IF_CH1DONE){
		/* nothing to do on DMA ch 1 ? */
	}
}
#define APP_ISR_isr_dma_STOP_SEC_CODE
#include "tpl_memmap.h"

#define APP_ISR_isr_rtc_START_SEC_CODE
#include "tpl_memmap.h"
ISR(isr_rtc){
	GPIO->P[gpioPortB].DOUT ^= (1<<9);
	RTC_IntClear(RTC_IF_COMP0);
	RTC_CounterReset();
	update_timekeeper();
	RTC_CompareSet(0, 32768);
}
#define APP_ISR_isr_rtc_STOP_SEC_CODE
#include "tpl_memmap.h"